abstract class SoaringText {
  static const traits = [
    '生命值', // 0
    '法力值', // 1
    '力量', // 2
    '体质', // 3
    '智力', // 4
    '精神', // 5
    '敏捷', // 6
    '速度', // 7
    '暴击', // 8
    '韧性', // 9
    '穿透', // 10
    '格挡', // 11
    '命中', // 12
    '闪避', // 13
    '攻击', // 14
    '防御', // 15
  ];
  static const itemTypes = [
    '装备', // 0
    '道具', // 1
  ];

  static const positions = [
    '头部', // 0
    '颈部', // 1
    '肩膀', // 2
    '背部', // 3
    '胸部', // 4
    '手腕', // 5
    '腰部', // 6
    '腿部', // 7
    '手指', // 8
    '饰品', // 9
    '主手', // 10
    '副手', // 11
  ];
}
