import 'package:flutter/material.dart';

class Labels {
  static const areas = [
    {"name": "柳絮小径", "description": "一条覆盖着绿荫柳树的小径，柳絮飘飞有如仙境，微风拂面，道旁偶有松鼠跃过。"},
    {"name": "碧水湾溪", "description": "清澈见底的溪水环抱着翠绿的小山谷，溪边常有野鹤畅饮，鱼儿畅游，宁静而祥和。"},
    {"name": "紫竹林口", "description": "高耸入云的紫色竹林，竹叶间偶尔传来竹鸡的鸣叫，传闻隐居者常在此遗留珍贵药材。"},
    {"name": "松风崖", "description": "险峻的悬崖上松树挺拔，山风呼啸，松间时有稀世珍兽出没，适合锻炼武功。"},
    {"name": "烟花巷", "description": "巷道两侧繁花似锦，花香醉人，昼夜不息，道上妖怪蔓延，似烟似花，莫辨真假。"},
    {"name": "玉石山脉", "description": "连绵不绝的山脉，石壁闪烁玉光，山洞中宝石丰富，却也怪石嶙峋，凶险异兽频出。"},
    {"name": "古剑冢", "description": "一处荒废的剑冢，遗落无数古剑，剑气四溢，挖掘宝剑需警惕沉睡剑灵。"},
    {"name": "白雾森林", "description": "迷雾缭绕的森林，光影婆娑，树木苍劲，却隐藏着行踪诡秘的野兽和迷幻阵法。"},
    {"name": "流沙谷", "description": "纵横交错的沙流中埋藏沙魔，狂风卷起沙暴，步步惊心，财宝与陷阱并存。"},
    {"name": "金莲花海", "description": "异域花海, 金莲盛放，地面蜿蜒，花之海中怪力乱神，美貌下的险惧难测。"},
    {"name": "剑气长城", "description": "古代大侠留下的气运所化长城，剑意盎然，不时会吸引武林人士前来切磋。"},
    {"name": "霜火岭", "description": "岭上火山与寒冰共存，是烈火与冰霜魔兽争斗之地，考验着每一位行者的武功与智慧。"},
    {"name": "双龙瀑", "description": "瀑布如两条盘旋之龙，水声轰鸣，水中有凶猛水兽，也有珍贵的水属性材料。"},
    {"name": "凤凰台", "description": "苍穹之下露天巨台，凤鸣声声，是历练武者战斗的热血之地，也吸引了不少强者的逐鹿。"},
    {"name": "幽灵山谷", "description": "山谷中常年雾蒙蒙一片，精怪为患，而幽谷深处据说隐藏着传说中的遗宝。"},
    {"name": "琉璃火山", "description": "火山熔岩如琉璃流动，热浪滚滚，环境极端，挑战者需小心火系妖兽和不稳定的地质。"},
    {"name": "暗金沼泽", "description": "沼泽内部弥漫着淡淡金光，诡异莫测，仙草隐匿其中，但食人花与毒虫同样不少。"},
    {"name": "星辉密林", "description": "森林密布，夜晚星光点缀其间如梦如幻，森林深处黑暗却藏匿着不少机缘与危机。"},
    {"name": "破碎虚空", "description": "一处空间裂痕频发之地，武者可以在此试练空间之力，但千万小心来自虚空的不明生物。"},
    {"name": "极夜冰原", "description": "永夜所覆盖的冰原，冰风如刀割，除了冰属性的怪兽，更有心冷如霜的历练者。"}
  ];
  static const dungeons = [
    {
      "name": "幽谷幻境",
      "story":
          "流传于江湖的一片秘境，幽谷中仙气弥漫，据说是古代仙人修行之所。然幽谷亦为邪魔所藏，各路武林侠士进入探索，寻找失落的神功秘籍，却需提防埋伏的血蝠群和毒蛊之灾。"
    },
    {
      "name": "古剑奇谭",
      "story":
          "剑冢深处，蕴藏着无数传说中的名剑。勇气与力量的象征，引无数侠客前来一试剑缘。剑灵吟唱着不为人知的往事，护卫着剑冢的秘密，而剑阵之外，则是机关重居，守护神剑不失。"
    },
    {
      "name": "碧水寒潭",
      "story":
          "青山之畔，有一潭碧水似镜。水中游动着珍奇异兽，更有深潭中的水鬼狐仙，为人提心吊胆。在古籍记载中，此潭深处暗藏一脉绝世武功，潜藏着历代高手都未解之谜。"
    },
    {
      "name": "百花谷秘境",
      "story":
          "百花谷之中花开四季，繁花似锦。谷中不仅有奇花异草，亦有诡异毒虫，中有异兽护花；仙侠传承此地，谷底古洞伏有乱世神兵，引得无数英雄至此探秘。"
    },
    {
      "name": "朱雀天穹",
      "story":
          "擎天柱撑起的异界之穹，传说为朱雀神兽的飞升之地。上古神鸟的化身虎视眈眈，护持着神龛秘宝。风云变幻的天空阵法，守卫着通往朱雀神兽的秘道。"
    },
    {
      "name": "幻世仙境",
      "story":
          "远山传来丁香般的淡雅香气，仙境被瘴气所遮，外人罕至。内有坠星湖，相传内藏天外飞仙所遗异宝。危机四伏的水域中，隐藏着凶猛的水兽与人鱼一族。"
    },
    {
      "name": "龙渊古洞",
      "story":
          "龙渊古洞深不可测，是江湖腹地的秘境之一。古洞中有龙息缭绕，洞穴岩壁上布满了精细奇异的龙形图腾。传说有着一条古龙的遗骸藏身其间，守护着不为人知的至宝。"
    },
    {
      "name": "凤凰书院",
      "story":
          "隐秘于山谷之间的凤凰书院，典藏了历代武林至宝和绝世武学。书院设有严密的机关陷阱，有着化形的古禽凤凰守望，只为汲取有缘人的气力，守护这无尽的智慧之源。"
    },
    {
      "name": "玉虚宫殿",
      "story":
          "云雾之巅，玉虚宫殿悬浮于仙云上方，玄关禁制重重。宫殿内弥漫着浓郁的灵气，是诸多修仙者心中神往之地。无数身影在宫内穿梭，或为探寻失落的修仙秘法，或为求一窥宫殿中的真正秘密。"
    },
    {
      "name": "虚空禁地",
      "story":
          "在轮回的边缘有一个被诸仙忌惮的虚空禁地。传说中的仙魔殊途，尽在此地交汇，奇景幻象层出不穷。地中结束了无尽岁月的冥想，魔头觉醒，企图破界而出。"
    },
    {
      "name": "九霄雷宫",
      "story":
          "飘渺之上的九霄雷宫，乃是天雷之神镇守之地。各种雷电交织的试炼场所，每一步皆需足智多谋。雷宫藏有天雷真诀，修者一旦得之，即可雷霆万钧，威震寰宇。"
    },
    {
      "name": "冥王炼狱",
      "story":
          "黄泉之下的冥王炼狱，是冥界至高无上的存在所铸就的煉体之地。幽魂彷徨，哀嚎遍布，炼狱中汪洋大海的苦海无边，海中生有黑水蛟龙，警戒着每一位涉足者。"
    },
    {
      "name": "梦回瑶池",
      "story":
          "瑶池，天界之美景，如今只能在梦中寻觅。瑶池中幽灵般的倩影，追忆着过往仙家盛事。池中的月镜石下，埋藏着月神遗忘的神器，静待有缘者的揭秘。"
    },
    {
      "name": "寂灭之塔",
      "story":
          "屹立不倒的寂灭之塔，传闻为上古大能用于困锁妖魔的禁地。每层塔中都生有阵法异兽，镇守者用其锐利的巨嘴、尖利的爪牙阻挡着探秘者。塔顶有至高无上的法器，是夺取与镇魔之匙。"
    },
    {
      "name": "天穹遗园",
      "story":
          "在亘古云天之上，隐藏着一座被遗忘的园林，天穹遗园。园内荒草丛生，偶有仙鹤栖息，诉说着它们昔日的主人何等辉煌。园中的翡翠水榭下，蕴存着遗世的神器和禁忌的仙法。"
    },
    {
      "name": "御剑山庄",
      "story": "隐匿于连绵仙山之中的御剑山庄，是剑修争锋较量之地。庄内风云激荡，剑影纵横，藏有历代剑豪留下的珍贵剑谱和神秘宝物。"
    },
    {
      "name": "隐龙洞府",
      "story":
          "在古意盎然的山谷深处，隐匿着一洞府。洞府中有龙腾涌动之势，隐龙尚未现形，但其洞府内的机关、阵法已是非同小可。洞府深处，更有传说中的天龙真典静静地守候着有缘之人。"
    },
    {
      "name": "紫霞秘境",
      "story":
          "霞光万丈的紫霞秘境，仙气环绕，传说乃当年紫霞仙子修炼之所。境中有千种奇花异果，亦藏有成仙秘诀，但路途险阻，仙兽横行，每一步都需要迈过生死劫。"
    },
    {
      "name": "玄武神冢",
      "story":
          "玄武神冢坐落于崇山峻岭之间，被誉为山岳之帝灵冢。冢内遍布厚重的山岳之力，压迫着挑战者的身心灵魂。不仅如此，玄武遗魂亦在此游荡，守护着其不朽的遗产。"
    },
    {
      "name": "火云宫殿",
      "story":
          "火云宫殿，烈焰滔天之地。古老的宫殿中火光摇曳，如同熔岩一般的地形，是考验修者火系功法的最佳场所。传说宫殿深处，封印着一位火系神兽，其余弥勒数千载的神焰，可炼化世间一切非凡物。"
    }
  ];
  static const difficultyTexts = ['简单', '普通', '困难', '绝境'];
  static const difficultyColors = [
    Colors.grey,
    Colors.white,
    Colors.orange,
    Colors.red,
  ];
  static const pages = ['装备', '背包', '地图', '地下城', '任务', '设置'];
  static const levels = ['粗糙', '普通', '优秀', '精良', '史诗', '传说'];
  static const rankColors = [
    Colors.grey,
    Colors.white,
    Colors.green,
    Colors.blue,
    Colors.purpleAccent,
    Colors.orange,
  ];
  static const traits = [
    '攻击',
    '防御',
    '生命值',
    '法力值',
    '力量',
    '敏捷',
    '智力',
    '精神',
    '体质',
    '速度',
    '暴击',
    '格挡',
    '抗性',
    '命中',
    '闪避',
    '穿透',
    '韧性',
  ];
  static const positions = [
    '头部',
    '颈部',
    '肩膀',
    '背部',
    '胸部',
    '手腕',
    '腰部',
    '腿部',
    '手指',
    '饰品',
    '主手',
    '副手',
  ];
  static const equipments = [
    ['头盔', '头巾'],
    ['项链'],
    ['肩甲'],
    ['披风'],
    ['胸甲'],
    ['护腕'],
    ['腰带'],
    ['护腿'],
    ['戒指'],
    ['饰品'],
    ['刀', '枪', '剑', '斧'],
    ['刀', '枪', '剑', '斧'],
  ];

  static const tiles = [
    '墙壁',
    '战斗',
    '事件',
    '起点',
    '终点',
  ];

  static const firstNames = [
    '欧阳',
    '太史',
    '端木',
    '上官',
    '司马',
    '东方',
    '独孤',
    '南宫',
    '万俟',
    '闻人',
    '夏侯',
    '诸葛',
    '尉迟',
    '公羊',
    '赫连',
    '澹台',
    '皇甫',
    '宗政',
    '濮阳',
    '公冶',
    '太叔',
    '申屠',
    '公孙',
    '慕容',
    '仲孙',
    '钟离',
    '长孙',
    '宇文',
    '司徒',
    '鲜于',
    '司空',
    '闾丘',
    '子车',
    '亓官',
    '司寇',
    '巫马',
    '公西',
    '颛孙',
    '壤驷',
    '公良',
    '漆雕',
    '乐正',
    '宰父',
    '谷梁',
    '拓跋',
    '夹谷',
    '轩辕',
    '令狐',
    '段干',
    '百里',
    '呼延',
    '东郭',
    '南门',
    '羊舌',
    '微生',
    '公户',
    '公玉',
    '公仪',
    '梁丘',
    '公仲',
    '公上',
    '公门',
    '公山',
    '公坚',
    '左丘',
    '公伯',
    '西门',
    '公祖',
    '第五',
    '公乘',
    '贯丘',
    '公皙',
    '南荣',
    '东里',
    '东宫',
    '仲长',
    '子书',
    '子桑',
    '即墨',
    '达奚',
    '褚师',
    '吴铭'
  ];
  static const tileTypes = ['墙壁', '道路', '怪物', '事件', '起点', '终点'];
  static const rewards = ['无', '经验', '金币', '装备', '道具'];
}
