import 'package:flutter/material.dart';

class Labels {
  static const areas = [
    {"name": "柳絮小径", "description": "一条覆盖着绿荫柳树的小径，柳絮飘飞有如仙境，微风拂面，道旁偶有松鼠跃过。"},
    {"name": "碧水湾溪", "description": "清澈见底的溪水环抱着翠绿的小山谷，溪边常有野鹤畅饮，鱼儿畅游，宁静而祥和。"},
    {"name": "紫竹林口", "description": "高耸入云的紫色竹林，竹叶间偶尔传来竹鸡的鸣叫，传闻隐居者常在此遗留珍贵药材。"},
    {"name": "松风崖", "description": "险峻的悬崖上松树挺拔，山风呼啸，松间时有稀世珍兽出没，适合锻炼武功。"},
    {"name": "烟花巷", "description": "巷道两侧繁花似锦，花香醉人，昼夜不息，道上妖怪蔓延，似烟似花，莫辨真假。"},
    {"name": "玉石山脉", "description": "连绵不绝的山脉，石壁闪烁玉光，山洞中宝石丰富，却也怪石嶙峋，凶险异兽频出。"},
    {"name": "古剑冢", "description": "一处荒废的剑冢，遗落无数古剑，剑气四溢，挖掘宝剑需警惕沉睡剑灵。"},
    {"name": "白雾森林", "description": "迷雾缭绕的森林，光影婆娑，树木苍劲，却隐藏着行踪诡秘的野兽和迷幻阵法。"},
    {"name": "流沙谷", "description": "纵横交错的沙流中埋藏沙魔，狂风卷起沙暴，步步惊心，财宝与陷阱并存。"},
    {"name": "金莲花海", "description": "异域花海, 金莲盛放，地面蜿蜒，花之海中怪力乱神，美貌下的险惧难测。"},
    {"name": "剑气长城", "description": "古代大侠留下的气运所化长城，剑意盎然，不时会吸引武林人士前来切磋。"},
    {"name": "霜火岭", "description": "岭上火山与寒冰共存，是烈火与冰霜魔兽争斗之地，考验着每一位行者的武功与智慧。"},
    {"name": "双龙瀑", "description": "瀑布如两条盘旋之龙，水声轰鸣，水中有凶猛水兽，也有珍贵的水属性材料。"},
    {"name": "凤凰台", "description": "苍穹之下露天巨台，凤鸣声声，是历练武者战斗的热血之地，也吸引了不少强者的逐鹿。"},
    {"name": "幽灵山谷", "description": "山谷中常年雾蒙蒙一片，精怪为患，而幽谷深处据说隐藏着传说中的遗宝。"},
    {"name": "琉璃火山", "description": "火山熔岩如琉璃流动，热浪滚滚，环境极端，挑战者需小心火系妖兽和不稳定的地质。"},
    {"name": "暗金沼泽", "description": "沼泽内部弥漫着淡淡金光，诡异莫测，仙草隐匿其中，但食人花与毒虫同样不少。"},
    {"name": "星辉密林", "description": "森林密布，夜晚星光点缀其间如梦如幻，森林深处黑暗却藏匿着不少机缘与危机。"},
    {"name": "破碎虚空", "description": "一处空间裂痕频发之地，武者可以在此试练空间之力，但千万小心来自虚空的不明生物。"},
    {"name": "极夜冰原", "description": "永夜所覆盖的冰原，冰风如刀割，除了冰属性的怪兽，更有心冷如霜的历练者。"}
  ];
  static const dungeons = [
    {
      "name": "幽谷幻境",
      "story":
          "流传于江湖的一片秘境，幽谷中仙气弥漫，据说是古代仙人修行之所。然幽谷亦为邪魔所藏，各路武林侠士进入探索，寻找失落的神功秘籍，却需提防埋伏的血蝠群和毒蛊之灾。"
    },
    {
      "name": "古剑奇谭",
      "story":
          "剑冢深处，蕴藏着无数传说中的名剑。勇气与力量的象征，引无数侠客前来一试剑缘。剑灵吟唱着不为人知的往事，护卫着剑冢的秘密，而剑阵之外，则是机关重居，守护神剑不失。"
    },
    {
      "name": "碧水寒潭",
      "story":
          "青山之畔，有一潭碧水似镜。水中游动着珍奇异兽，更有深潭中的水鬼狐仙，为人提心吊胆。在古籍记载中，此潭深处暗藏一脉绝世武功，潜藏着历代高手都未解之谜。"
    },
    {
      "name": "百花谷秘境",
      "story":
          "百花谷之中花开四季，繁花似锦。谷中不仅有奇花异草，亦有诡异毒虫，中有异兽护花；仙侠传承此地，谷底古洞伏有乱世神兵，引得无数英雄至此探秘。"
    },
    {
      "name": "朱雀天穹",
      "story":
          "擎天柱撑起的异界之穹，传说为朱雀神兽的飞升之地。上古神鸟的化身虎视眈眈，护持着神龛秘宝。风云变幻的天空阵法，守卫着通往朱雀神兽的秘道。"
    },
    {
      "name": "幻世仙境",
      "story":
          "远山传来丁香般的淡雅香气，仙境被瘴气所遮，外人罕至。内有坠星湖，相传内藏天外飞仙所遗异宝。危机四伏的水域中，隐藏着凶猛的水兽与人鱼一族。"
    },
    {
      "name": "龙渊古洞",
      "story":
          "龙渊古洞深不可测，是江湖腹地的秘境之一。古洞中有龙息缭绕，洞穴岩壁上布满了精细奇异的龙形图腾。传说有着一条古龙的遗骸藏身其间，守护着不为人知的至宝。"
    },
    {
      "name": "凤凰书院",
      "story":
          "隐秘于山谷之间的凤凰书院，典藏了历代武林至宝和绝世武学。书院设有严密的机关陷阱，有着化形的古禽凤凰守望，只为汲取有缘人的气力，守护这无尽的智慧之源。"
    },
    {
      "name": "玉虚宫殿",
      "story":
          "云雾之巅，玉虚宫殿悬浮于仙云上方，玄关禁制重重。宫殿内弥漫着浓郁的灵气，是诸多修仙者心中神往之地。无数身影在宫内穿梭，或为探寻失落的修仙秘法，或为求一窥宫殿中的真正秘密。"
    },
    {
      "name": "虚空禁地",
      "story":
          "在轮回的边缘有一个被诸仙忌惮的虚空禁地。传说中的仙魔殊途，尽在此地交汇，奇景幻象层出不穷。地中结束了无尽岁月的冥想，魔头觉醒，企图破界而出。"
    },
    {
      "name": "九霄雷宫",
      "story":
          "飘渺之上的九霄雷宫，乃是天雷之神镇守之地。各种雷电交织的试炼场所，每一步皆需足智多谋。雷宫藏有天雷真诀，修者一旦得之，即可雷霆万钧，威震寰宇。"
    },
    {
      "name": "冥王炼狱",
      "story":
          "黄泉之下的冥王炼狱，是冥界至高无上的存在所铸就的煉体之地。幽魂彷徨，哀嚎遍布，炼狱中汪洋大海的苦海无边，海中生有黑水蛟龙，警戒着每一位涉足者。"
    },
    {
      "name": "梦回瑶池",
      "story":
          "瑶池，天界之美景，如今只能在梦中寻觅。瑶池中幽灵般的倩影，追忆着过往仙家盛事。池中的月镜石下，埋藏着月神遗忘的神器，静待有缘者的揭秘。"
    },
    {
      "name": "寂灭之塔",
      "story":
          "屹立不倒的寂灭之塔，传闻为上古大能用于困锁妖魔的禁地。每层塔中都生有阵法异兽，镇守者用其锐利的巨嘴、尖利的爪牙阻挡着探秘者。塔顶有至高无上的法器，是夺取与镇魔之匙。"
    },
    {
      "name": "天穹遗园",
      "story":
          "在亘古云天之上，隐藏着一座被遗忘的园林，天穹遗园。园内荒草丛生，偶有仙鹤栖息，诉说着它们昔日的主人何等辉煌。园中的翡翠水榭下，蕴存着遗世的神器和禁忌的仙法。"
    },
    {
      "name": "御剑山庄",
      "story": "隐匿于连绵仙山之中的御剑山庄，是剑修争锋较量之地。庄内风云激荡，剑影纵横，藏有历代剑豪留下的珍贵剑谱和神秘宝物。"
    },
    {
      "name": "隐龙洞府",
      "story":
          "在古意盎然的山谷深处，隐匿着一洞府。洞府中有龙腾涌动之势，隐龙尚未现形，但其洞府内的机关、阵法已是非同小可。洞府深处，更有传说中的天龙真典静静地守候着有缘之人。"
    },
    {
      "name": "紫霞秘境",
      "story":
          "霞光万丈的紫霞秘境，仙气环绕，传说乃当年紫霞仙子修炼之所。境中有千种奇花异果，亦藏有成仙秘诀，但路途险阻，仙兽横行，每一步都需要迈过生死劫。"
    },
    {
      "name": "玄武神冢",
      "story":
          "玄武神冢坐落于崇山峻岭之间，被誉为山岳之帝灵冢。冢内遍布厚重的山岳之力，压迫着挑战者的身心灵魂。不仅如此，玄武遗魂亦在此游荡，守护着其不朽的遗产。"
    },
    {
      "name": "火云宫殿",
      "story":
          "火云宫殿，烈焰滔天之地。古老的宫殿中火光摇曳，如同熔岩一般的地形，是考验修者火系功法的最佳场所。传说宫殿深处，封印着一位火系神兽，其余弥勒数千载的神焰，可炼化世间一切非凡物。"
    }
  ];
  static const difficultyTexts = ['简单', '普通', '困难', '绝境'];
  static const difficultyColors = [
    Colors.grey,
    Colors.white,
    Colors.orange,
    Colors.red,
  ];
  static const pages = ['装备', '背包', '任务', '地图', '地宫', '无尽试炼', '设置'];
  static const levels = ['粗糙', '普通', '优秀', '精良', '史诗', '传说'];
  static const rankColors = [
    Colors.grey,
    Colors.white,
    Colors.green,
    Colors.blue,
    Colors.purpleAccent,
    Colors.orange,
  ];
  static const equipments = [
    ['头盔', '头巾'],
    ['项链'],
    ['肩甲'],
    ['披风'],
    ['胸甲'],
    ['护腕'],
    ['腰带'],
    ['护腿'],
    ['戒指'],
    ['饰品'],
    ['刀', '枪', '剑', '斧'],
    ['刀', '枪', '剑', '斧'],
  ];

  static const firstNames = [
    '欧阳',
    '太史',
    '端木',
    '上官',
    '司马',
    '东方',
    '独孤',
    '南宫',
    '万俟',
    '闻人',
    '夏侯',
    '诸葛',
    '尉迟',
    '公羊',
    '赫连',
    '澹台',
    '皇甫',
    '宗政',
    '濮阳',
    '公冶',
    '太叔',
    '申屠',
    '公孙',
    '慕容',
    '仲孙',
    '钟离',
    '长孙',
    '宇文',
    '司徒',
    '鲜于',
    '司空',
    '闾丘',
    '子车',
    '亓官',
    '司寇',
    '巫马',
    '公西',
    '颛孙',
    '壤驷',
    '公良',
    '漆雕',
    '乐正',
    '宰父',
    '谷梁',
    '拓跋',
    '夹谷',
    '轩辕',
    '令狐',
    '段干',
    '百里',
    '呼延',
    '东郭',
    '南门',
    '羊舌',
    '微生',
    '公户',
    '公玉',
    '公仪',
    '梁丘',
    '公仲',
    '公上',
    '公门',
    '公山',
    '公坚',
    '左丘',
    '公伯',
    '西门',
    '公祖',
    '第五',
    '公乘',
    '贯丘',
    '公皙',
    '南荣',
    '东里',
    '东宫',
    '仲长',
    '子书',
    '子桑',
    '即墨',
    '达奚',
    '褚师',
    '吴铭'
  ];
  static const tileTypes = ['墙壁', '道路', '战斗', '事件', '起点', '终点'];
  static const rewards = ['无', '经验', '金币', '装备', '道具'];
  static const events = [
    {"content": "你一行脚步回响在阴郁潮湿的地宫之中，一阵寒风吹过，似有剑气横空，顿时令你警觉四周。"},
    {"content": "忽闻石壁后传来轻微响动，像是有人正悄无声息地注视着你，你不禁握紧了手中的青钢剑。"},
    {"content": "穿过一排排古朽的石柱，你望见一个竹笠老者背对着你，正缓缓练着拂尘，气息内敛而深邃。"},
    {"content": "地宫中央铺设的玉石之上，镶嵌着一柄古剑，剑身已锈，然而仍有一缕剑意若隐若现，等待有缘之人。"},
    {"content": "一条暗河横亘于前，你伸手入水，倒映在水面的不是你的容颜，而是一副怒目金刚的面孔。"},
    {"content": "石阶蜿蜒向下，每一步都使你心跳加速。终于，在一扇紫铜门前停下，你深吸一口气，缓缓推开门扉。"},
    {"content": "暗室中突然传来铁链摩擦之声，一盏摇摇欲坠的油灯下，一个白发苍苍的老者睁开了久闭的双眼。"},
    {"content": "一丛白骨在昏暗的光线下显得格外刺眼，你小心翼翼地绕过，却触动了机关，数支箭矢骤然射来。"},
    {"content": "穿行于幽深走廊，忽听微风送来丝丝箫音，此曲只应天上有，怎会流落于此穷囚之境？"},
    {"content": "一座破旧的木桥横跨在两壁间，桥下深不见底，你稳住心神，手脚并用缓缓前行。"},
    {"content": "地宫深处，雾气弥漫，你屏息凝视，只见一位红衣女子倚剑而立，眼神冷漠，似有情仇未了。"},
    {"content": "黑暗中，一个充满机警的声音突然在你耳畔响起：“不想丢命的话，就留下你的财物。”"},
    {"content": "一间石室里摆放着一张石床，床上躺着一位剑眉星目的少侠，他的胸口正插着一柄断剑。"},
    {"content": "在一块宽大的石壁面前，你似乎看到了一行诗句，但下一刻，石壁突然移动，露出了一个秘道。"},
    {"content": "你背负双手，目光所及之处尽是枯骨。仿佛曾经一场绝世好战，在此留下了无尽的哀鸿和传说。"},
    {"content": "一行错落有致的脚印映入眼帘，你沿着脚印前行，却在转角处遭遇了一位笑容可掬的白衣少女。"},
    {"content": "壁龛中静静地放置着一枚玉佩，拿起时，玉佩内似有光芒流转，赫然是一件失传已久的门派之宝。"},
    {"content": "一个被药草香气环绕的房间里，满地都是未完全干透的草药，一位药师见你进入，微笑点头。"},
    {"content": "数盏宫灯忽明忽暗，映照着各色绸帛，其中一块刺绣珍贵，上有九天仙女下凡舞剑的绝世图案。"},
    {"content": "在一张锦衣展台前，陈设着各色珍奇的衣锦，微风吹过，衣摆轻舞，你驻足欣赏，忘了时间的流逝。"},
    {"content": "朦胧烛影下，你窥见一枚铁牌，上刻「地宫封印」四字，正是解开深处秘密的钥匙。"},
    {"content": "四周忽起奇风，你抬眼望去，只见无数兵器自壁中飞出，其间隐约有“飞刀”二字闪过。"},
    {"content": "地宫的一角，摆放着古琴一把，琴声悠扬，你辨得出这是「广陵散」的前奏，却不见弹奏之人。"},
    {"content": "细雨绵绵，在地宫里竟奇迹般地出现一片竹林，云雾缠绕中，一位剑客立于竹尖，目光如炬。"},
    {"content": "被藤蔓覆盖的墙壁突然裂开，现出一间石室，石室之中锋芒毕露的刀剑无声诉说着往日辉煌。"},
    {"content": "地宫深处，碧绿色的火焰中露出古怪的符咒，火焰旁一个守卫默立，神情冰冷，拒人千里。"},
    {"content": "走过一座桥，桥下突闻水声潺潺，凝视中，只见一尊石雕观音低首莲座，慈眉善目。"},
    {"content": "屋顶上忽有暗器飞落，你闪身躲避，却见那暗器竟然正是故人遗留的信物。"},
    {"content": "靠近一座青砖砌成的小亭，风中传来了断续的诗音，你立足留听，似乎能感受到旧时的幽梦。"},
    {"content": "一幅泼墨山水图悬挂在墙壁上，你凝视片刻，墨色竟流转起来，幻化为一条山间小径。"},
    {"content": "一名身穿粗布的老者盘膝坐于石床之上，看似平凡无奇，却隐含天地间的至简至真。"},
    {"content": "壁龛中静放着几卷泛黄的古籍，你挥去尘埃，发现其上记载着失传多年的武学绝学。"},
    {"content": "倏忽间，一道金光闪过，你顺着光芒看去，一条金龙正腾飞于壁画之中，瑞气满室。"},
    {"content": "地宫里一片漆黑，你忽听到脚步声越来越近，呼吸一凝，闭目静听，伺机而动。"},
    {"content": "踏过廊桥，两旁的石像忽然生风，像要栩栩如生，你心中有所警觉，按剑而行。"},
    {"content": "在地宫一隅捡到一支破旧的短箭，箭矢旁有蝌蚪文刻痕，似乎是某件大事的关键线索。"},
    {"content": "迷雾中隐约耸立着古老祭坛，坛上摆放着香炉三件，香烟缭绕，令人心神向往。"},
    {"content": "碰触到墙壁的机关，一面镜子缓缓转动，映出的不是你的身影，而是往昔岁月的幻影。"},
    {"content": "一条密道尽头，灯火通明处，坐落着一座石棺，棺盖缓缓移动，露出一个青年使者的面孔。"},
    {"content": "你发现一副对联挂在墙上，上联「虚空莫测」下联「奇门遁甲」，悟之片刻，竟似明悟武学精髓。"},
    {"content": "石门缓缓开启，映入眼帘的是一位美若天仙的女子，她凝视着你，眼中似乎带着千年的寂寞。"},
    {"content": "窗外突闻啼鸟之声，一阵清风吹入地宫，你顺着声音望去，却见数支羽箭向你袭来。"},
    {"content": "地面上零星散落着碎玉片，你仔细辨认，这些玉片竟拼合成一幅残缺的宝图。"},
    {"content": "一尊拔剑而立的雕像横亘于前，你伸手触摸剑柄，雕像眼中忽闪过一道精光。"},
    {"content": "一个蒙面人忽然从暗中现身，手持双剑，他身法诡异，似在等待着你的挑战。"},
    {"content": "走过一片石林，突然感受到一阵剑气逼人，你提气轻功，刹那间在剑影中穿梭而过。"},
    {"content": "一面破旧的青铜镜突然发出耀眼的光芒，你感到一股强大的吸力将你吸入其中。"},
    {"content": "在一间密室中，你发现了一张埋藏已久的棋盘，棋子虽旧，每一步却似蕴藏深意。"},
    {"content": "墙壁上挂着一把钢鞭，鞭身隐约刻有兽纹，你轻触之下，鞭影狂舞，似有生命。"},
    {"content": "地宫深处，摆着一具沙琴，琴音忽高忽低，随风飘荡，你不自主地便随之摇曳。"},
    {"content": "一阵奇异的香味扑鼻而来，你循着香味找到了一颗莹润的夜明珠，光华内敛却耀眼夺目。"},
    {"content": "墙上悬挂的钟久不敲，你一掌拍去，钟声回荡，似有无形波动在四周弥漫开来。"},
    {"content": "一个小乞丐坐在角落，见你走近，突然摘下面具，露出国色天香的容颜，是谜一般的传说。"},
    {"content": "地宫角落有一口井，井下传来淡淡水声，你观察许久，这水竟和外界孤月相通。"},
    {"content": "拾起一只旧玉簪，它上头的雕刻似有似无的遗失了一段凄美动人的往事，令你默然。"},
    {"content": "一缕阳光从岩缝间透下，照亮了一条蜿蜒向深处的通道，蕴藏着未知的机遇与危机。"},
    {"content": "你看到一盘围棋，棋局未毕，却仿若有人在借棋局传递一种玄妙的力量。"},
    {"content": "对座两石狮子，虽刻石为形，却带着一股不容侵犯的威严，你恭敬地绕行而过。"},
    {"content": "一块斑驳的石碑立在你的面前，碑上刻满了岁月的痕迹，似在讲述一段古老的传说。"},
    {"content": "你挑起一口铁锅，锅底出现一个暗仓，里面藏着一张黄纸，绘有陌上桑的图腾。"},
    {"content": "你刚行进几步，地面突然塌陷，一道深坑出现，你几乎要陷入其中，惊险地跳了回来。"},
    {"content": "脚下石板忽然活动，尖锐的箭矢从四面八方射出，你只得翻滚躲闪，险象环生。"},
    {"content": "前方石壁上突然有数支毒镖射来，你侧身闪避，却感到臂上一阵刺痛，毒入脉络。"},
    {"content": "一张巨网自上而下，将你严严实实地罩住，你挣扎着寻找开网之法，时间紧迫。"},
    {"content": "你触动了机关，石室的出口缓缓关闭，你必须在气息耗尽前找到重开的门机。"},
    {"content": "寻觅间，一个布满尘埃的骷髅突然动了，拿起地上的武器攻击你，空气中充满不祥。"},
    {"content": "地上的阴影忽左忽右，一把利刃似要从你脚下划出，你轻功展开，及时飞身避开。"},
    {"content": "走在地宫的狭道上，石壁忽然射出无数细针，你只得提气悬浮，险过此劫。"},
    {"content": "触碰到墙壁的机巧，房间内的温度骤然降低，你浑身一颤，感觉被寒气缠身。"},
    {"content": "一股奇异气流涌向你，发现竟是毒气，你急忙屏住呼吸，寻找逃离之路。"},
    {"content": "一道奇光忽然爆发，你的视线被刺得一片模糊，必须小心应对接下来的未知危机。"},
    {"content": "一幅画中的虎口忽然张开，射出几串小箭，你身形一晃，堪堪躲过这突如其来的伏击。"},
    {"content": "跨过一面石镜，忽觉背后有力量吸引，回头一看，石镜竟化做真实的黑洞。"},
    {"content": "地宫深处忽起阵阵狂风，嗖嗖声中，你感觉有物贴面而过，一股寒意透入心骨。"},
    {"content": "祭台中央的火盆突然熄灭，一片黑暗中似有眼睛注视着你，邪气逼人。"},
    {"content": "一条看似普通的通道，走着走着忽然变窄，四壁似乎在慢慢合拢，要将你挤压。"},
    {"content": "地面上的图案开始旋转，每旋转一次，就有一股力量试图将你卷入地下深渊。"},
    {"content": "你经过一个铁笼，笼中忽然伸出无数手臂，企图拖你进入，你急忙跳脱开去。"},
    {"content": "在狭小的空间中，墙壁上镶嵌的珠宝忽然爆闪，一时间令你失去方向感。"},
    {"content": "经过一个装饰华丽的香炉，一股悚然的蓝烟袅袅升起，你意识到这是剧毒，连忙捂口而逃。"},
    {"content": "一面看似普通的墙壁，你的触触之下，突然绽放出刺目光华，铺天盖地的飞镖向你射来。"},
    {"content": "你小心翼翼地走在长廊上，突然地砖下陷，一拉一扯间，你惊险地避开了隐藏在阴暗处的掌刃。"},
    {"content": "行走在曲径通幽处，一道机关突然激活，石狮口中吐出真火，你立足未稳，侧身勉强躲过。"},
    {"content": "前行至一处石室，正欲细看四周，忽听得石壁之中传来嗡嗡之声，蜂群如箭般扑来。"},
    {"content": "你刚欲饮水，未料水波不惊下，暗藏机括。一条水蛇突起，其毒颇为可怖，你连忙弃杯而退。"},
    {"content": "转过一座石拱门，脚下一不稳，掉入了一片荆棘之中，每一口气都充满了紧张与危机。"},
    {"content": "试图推开一扇石门，门后却是巨大的吸力，几乎要将你吞没，你用尽全力才得以摆脱。"},
    {"content": "一道石碑忽然坍塌，从中射出尖锐的利刃，你身形一闪便得以化险为夷。"},
    {"content": "你的每一步都十分谨慎，但猝不及防，油灯熄灭，一片漆黑中，似有凛冽剑气悄然逼近。"},
    {"content": "经过一处阵图，身形刚入阵心，就感到四周风起云涌，五行相生相克，身不由己。"},
    {"content": "一缕光亮指引你前进，而当你接近光源之处，却是一面镜子。望镜自照，你险些沉迷其中不能自拔。"},
    {"content": "一株普通的草本植物在你身旁摇曳，你细看之下，忽然射出数股剧毒，刺入你的肌肤之中。"},
    {"content": "几何光影在墙壁上交错，你心知不妙，倏地退后，就见一块石板猛地飞出，转眼即到眼前。"},
    {"content": "打开一扇小门，门后却是深不见底的深渊，你差一点踏空坠入，心有余悸。"},
    {"content": "地宫中突然迸发一道尖锐疾光，擦着你的耳边飞过，你全身紧绷，随时准备应对未知的威胁。"},
    {"content": "在一处桥下，你忽觉脚下一虚，原来桥板幻化为细沙，你一个猛子才没陷进去。"},
    {"content": "安静的石室里，一架棋盘安置在中央，你一触便悟，这棋局竟是玄妙陷阱，差点使你困于此地。"},
    {"content": "一桌酒席摆在一间密室内，你未曾动筷，便觉得四周空间突然闭合，逼仄之感瞬间袭来。"},
    {"content": "你踏入一片密林之中，每一株树木的叶片竟都隐藏了剧毒，一阵风过，你被迫运功抵御。"},
    {"content": "一面石壁上突然涌出一道奇异的纹路，你凝视未久，周围空间已被困阵禁锢，要费些周折才能脱身。"}
  ];
  static const creatures = [
    "九尾妖狐",
    "琵琶精",
    "墨眉魔",
    "赤炎妖龙",
    "玉面蛇妖",
    "青翼蝠王",
    "白骨夫人",
    "千年古屍",
    "幽冥鬼将",
    "灵魂摄取者",
    "墨水怪兽",
    "黑暗剑侠",
    "天罗傀儡",
    "迷雾幽灵",
    "碧水螭吻",
    "雾隐鬼母",
    "金甲石人",
    "紫电蚩尤",
    "凌空飞狐",
    "魔化蟾蜍",
    "怒火雷龟",
    "苍穹雷鹏",
    "镜花水月",
    "青铜狞猊",
    "彩云仙猴",
    "九幽白骨蛇",
    "星河巨鳄",
    "暗夜魔狸",
    "万剑飞鹰",
    "炎帝蝎尊",
    "风行烈豹",
    "冰晶雪狼",
    "玄冰麒麟",
    "赤炎鬼蝶",
    "夜啸长空鬼",
    "双生花妖",
    "翠羽凤凰",
    "金光仙蝉",
    "傲世魔牛",
    "墨羽扇狐",
    "天痕鬼面",
    "幻日狮子",
    "霜冻犀牛",
    "毒牙蛇灵",
    "迷雾夜叉",
    "断魂飞燕",
    "锦瑟歌姬",
    "炼狱魔蛛",
    "天雷战熊",
    "幽影狐仙",
    "石肤岩魔",
    "噬骨恶蝠",
    "缚魂鬼睛",
    "魔光蓝蝶",
    "血翼魔鹤",
    "烈焰妖猫",
    "碧眼金蛟",
    "飓风疾豹",
    "暗影魅狐",
    "幽冥火凤",
    "苍穹虚龙",
    "虚空裂魔",
    "虎啸山鬼",
    "金甲地妖",
    "莲花妖姬",
    "黄土石怪",
    "斩月剑鬼",
    "重霄霹雳兽",
    "琼浆玉液兽",
    "红尘幻影",
    "剧毒血蛛",
    "白浪魂狼",
    "烈火狂狮",
    "金铃古狐",
    "沧海巨蛙",
    "露珠精灵",
    "寒冰巨熊",
    "金光煞狼",
    "玉笛仙鹤",
    "苍山猎豹",
    "幻影灵猿",
    "九天哭魔",
    "暗刃毒蝎",
    "穷奇异兽",
    "九黎巫灵",
    "天域狐王",
    "水晶冰妖",
    "魂吸鬼王",
    "雷霆战狼",
    "蓬莱仙鹿",
    "影子刺客",
    "云游火蛇",
    "血影妖蝠",
    "夜行云豹",
    "幻境病妖",
    "千影鬼镰",
    "海霧巨靈",
    "云端灵兽",
    "罡风刃狼"
  ];
}
